# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

a = [2, 3, 4, 5, 6]
pon = 0

if len(a) % 2 == 0:
    n = int(len(a)/2)
    for i in range(0, n):
        pon = a[i]*a[len(a)-1-i]
        print (pon, end=' ')
else:
    n = int(len(a)/2+1)
    for i in range(0, n):
        pon = a[i]*a[len(a)-1-i]
        print (pon, end=' ')