# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

a = [1.1, 1.2, 3.1, 5, 10.01]

b = []

for i in range(0, len(a)):
    a[i]=a[i]-int(a[i])
    if a[i] != 0:
        b.append(a[i])

max = b[0]
min = b[0]

for i in range(1, len(b)):
    if b[i] > max:
        max = b[i]
    if b[i] < min:
        min = b[i]

print(format(max-min, '.2f'))